<a href="https://colab.research.google.com/github/Saneesh122/Data-Processing-Visualization-/blob/main/Quiz_13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Quiz-13**

In [1]:
import pandas as pa

data = pa.read_csv('https://raw.githubusercontent.com/nurfnick/Data_Viz/main/bank.csv')

data.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

**1) What is the data type of the first column? Should you change it or is that the best data type.**

- First column has integer datatype. No, I would not change it

**2) The second column is job could you assign an order to this string? Could you assign an order the the fourth column education. If yes, what order would you assign? Do so.**

- In my view second column cannot be assigned in order to the strings. For the fourth column-yes we can assign an order.

**3) Could any of the columns have been a boolean? Find one and create a new column in the dataframe that is just boolean and has a descriptive name.**

- Yes, there are three boolean column i.e:- housing, loan, and y. Code will be down below:-

In [2]:
import numpy as np

In [3]:
data['Above 30'] = np.where(data['age'] >= 30, True, False)
# display the dataframe
print(data)

      age            job  marital  education  ... previous  poutcome   y Above 30
0      30     unemployed  married    primary  ...        0   unknown  no     True
1      33       services  married  secondary  ...        4   failure  no     True
2      35     management   single   tertiary  ...        1   failure  no     True
3      30     management  married   tertiary  ...        0   unknown  no     True
4      59    blue-collar  married  secondary  ...        0   unknown  no     True
...   ...            ...      ...        ...  ...      ...       ...  ..      ...
4516   33       services  married  secondary  ...        0   unknown  no     True
4517   57  self-employed  married   tertiary  ...        0   unknown  no     True
4518   57     technician  married  secondary  ...        0   unknown  no     True
4519   28    blue-collar  married  secondary  ...        3     other  no    False
4520   44   entrepreneur   single   tertiary  ...        7     other  no     True

[4521 rows x 18 columns]

**4) Name one more interesting fact about this dataset and the datatypes.**

- Interesting fact about dataset and the datatypes is easier to use and reliable.